examples/tumor_chip_linear_gradient/data/diagnostic/ladder_scan/case_019/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

12
(
    inlet_0
    {
        type            patch;
        nFaces          6;
        startFace       18952;
    }
    inlet_1
    {
        type            patch;
        nFaces          6;
        startFace       18958;
    }
    inlet_2
    {
        type            patch;
        nFaces          6;
        startFace       18964;
    }
    inlet_3
    {
        type            patch;
        nFaces          6;
        startFace       18970;
    }
    inlet_4
    {
        type            patch;
        nFaces          6;
        startFace       18976;
    }
    inlet_5
    {
        type            patch;
        nFaces          6;
        startFace       18982;
    }
    inlet_6
    {
        type            patch;
        nFaces          6;
        startFace       18988;
    }
    inlet_7
    {
        type            patch;
        nFaces          6;
        startFace       18994;
    }
    outlet
    {
        type            patch;
        nFaces          48;
        startFace       19000;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       19048;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       19048;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19200;
        startFace       19448;
    }
)

// ************************************************************************* //
